/* Copyright © 2001-2012 Apple Inc. All Rights Reserved. */
/* Localization dictionary for Apple Hardware Test 3.0 series */

"is-two-bytes"	= "0";
"version-sig"	= "SV-070918";

"common-controls-restart"		= "Starta om";
"common-controls-shutdown"		= "Stäng av";
"common-controls-continue"		= "Fortsätt";

"common-tab-apple-title"		= " Om ";			// does look better with spaces at head and tail
"common-tab-test-title"			= " Maskinvarutest ";	// does look better with spaces at head and tail
"common-tab-profile-title"		= " Maskinvaruprofil ";	// does look better with spaces at head and tail
"common-version-str"			= "Version ";
"common-bundle-str"				= "Paket ";

"mark-graphics-unknown-str"		= "Okänt bildminne";
"mark-graphics-none-str"		= " ";

"mark-generic-present-str"		= "Installerad";
"mark-generic-absent-str"		= "Hittades inte";
"mark-generic-hasDevice-str"	= "Enhet ansluten";
"mark-generic-hasNoDevice-str"	= "Ingen enhet ansluten";

"units-hz--short-str"	= "Hz";
"units-hz--long-str"	= "Hertz";
"units-byte-short-str"	= "B";
"units-byte-long-str"	= "byte";
"units-bit-short-str"	= "b";
"units-bit-long-str"	= "bit";
"units-volt-short-str"	= "V";
"units-volt-long-str"	= "volt";


"units-hour-str"		= " timme ";
"units-hours-str"		= " timmar ";
"units-min-str"			= " min ";
"units-mins-str"		= " min ";
"units-sec-str"			= " sek";
"units-secs-str"		= " sek";

"units-kilo-str"		= "K";
"units-mega-str"		= "M";
"units-giga-str"		= "G";
"units-tera-str"		= "T";

"delim-date-str"		= "-";
"delim-at-str"			= " @ ";
"delim-record-str"		= ":";
"delim-field-str"		= ", ";
"delim-item-str"		= "-";
"delim-decimal-str"		= ",";
"delim-thousds-str"		= "  ";
"delim-space-str"		= " ";
"delim-pct-str"			= " %";

"notcompat-nosupport-str"		= "Apple Hardware Test stöder inte denna dator.";
"notcompat-ownrisk-str"			= "Fortsätt på egen risk [endast förhandsversion].";


"test-head-intro1-text"			= "Apple Hardware Test utför maskinvarutestning av din Mac.";
"test-head-intro2-text"			= "Om du vill testa datorn klickar du på knappen ”Testa” eller trycker på ”T”-tangenten.";

"test-probe-onto-text"			= "Undersöker maskinvaran. Det kan ta en stund...";
"test-probe-outof-text"			= "Undersökning av maskinvaran slutförd.";

"test-controls-launch"			= "Testa";
"test-controls-interrupt"		= "Avbryt test";

"test-choices-title"			= "Testalternativ";
"test-about-title"				= "Om testen och resultaten";
"test-results-title"			= "Testresultat";

"test-results-notestyet"		= "Test kan inte köras innan undersökningen är klar.";
"test-results-nodevfound"		= "Inga enheter hittades.";
"test-results-notyet"			= "Redo för test.";
"test-results-quick-ongoing"	= "Testning pågår.";
"test-results-extend-ongoing"	= "Ett utökat test pågår.";
"test-results-willstop"			= "Testet avbryts.";
"test-results-interrupted"		= "Testningen avbröts.";
"test-results-nofail"			= "Inga problem upptäcktes.";
"test-results-error"			= "Internt fel under testet.";
"test-results-failed"			= "Varning! Apple Hardware Test har upptäckt ett fel.";

"test-ongoing-short-status"		= "Testning pågår.";
"test-ongoing-mlb-status"		= "Testar logikkortet.";
"test-ongoing-memory-status"	= "Testar minnet.";
"test-ongoing-storage-status"	= "Testar lagringen.";
"test-ongoing-video-status"		= "Testar grafiken.";

"test-ongoing-pass-time-text"	= " har passerat...";
"test-ongoing-pass-time-1-text"	= " ";
"test-ongoing-pass-time-2-text"	= "har passerat...";
"test-ongoing-sess-pass-text"	= "Pass nummer: ";
"test-ongoing-sess-time-text"	= "Total testtid: ";

"test-desc-initial-1-text"	= "Apple Hardware Test är ett diagnostiskt verktyg som kan upptäcka interna maskinvaruproblem i datorn.";
"test-desc-initial-2-text"	= " ";
"test-desc-initial-3-text"	= "Testen som utförs hjälper dig att avgöra om du har ett problem som gäller maskinvaran eller programvaran.";
"test-desc-initial-4-text"	= " ";
"test-desc-initial-5-text"	= "Om testen visar att du inte har ett problem som gäller maskinvaran kan du läsa manualen som följde med datorn, eller det inbyggda Hjälp-systemet som finns i operativsystemet.";
"test-desc-initial-6-text"	= " ";

"test-desc-intro-quick-text"	= "Uppskattad tid för testet: 3 minuter eller längre, beroende på hur mycket minne som finns installerat.";	/* default */
"test-desc-intro-quick-text2"	= "Uppskattad tid för testet: 10 till 15 sekunder eller längre, beroende på hur mycket minne som finns installerat.";
"test-desc-intro-quick-text3"	= "Uppskattad tid för testet: 2 minuter eller längre, beroende på hur mycket minne som finns installerat.";
"test-desc-intro-quick-text4"	= "Uppskattad tid för testet: 4 minuter eller längre, beroende på hur mycket minne som finns installerat.";

"test-desc-intro-extend-text"	= "Uppskattad tid för testet: 1 timme eller längre, beroende på hur mycket minne som finns installerat.";	/* default */
"test-desc-intro-extend-text2"	= "Uppskattad tid för testet: 10 till 15 minuter eller längre, beroende på hur mycket minne som finns installerat.";
"test-desc-intro-extend-text3"	= "Uppskattad tid för testet: 30 minuter eller längre, beroende på hur mycket minne som finns installerat.";
"test-desc-intro-extend-text4"	= "Uppskattad tid för testet: 2 timmar eller längre, beroende på hur mycket minne som finns installerat.";

"test-desc-option-extend-text"	= "Gör ett utökat test (tar mycket längre tid).";
"test-desc-option-loop-text"	= "Loopning aktiverat.";

"test-desc-quick-running-1-text"	= "Ett test pågår...";
"test-desc-quick-running-2-text"	= "Om du vill avbryta klickar du på knappen ”Avbryt test”.";
"test-desc-quick-running-3-text"	= "Eller, tryck på kommandotangenten (”Apple-tangenten”) och ”.” (punkt) samtidigt.";
"test-desc-quick-running-4-text"	= " ";

"test-desc-extend-running-1-text"	= "Ett utökat test pågår...";
"test-desc-extend-running-2-text"	= "Om du vill avbryta klickar du på knappen ”Avbryt test”.";
"test-desc-extend-running-3-text"	= "Eller, tryck på kommandotangenten (”Apple-tangenten”) och ”.” (punkt) samtidigt.";
"test-desc-extend-running-4-text"	= " ";

/* About the Tests and Results Test tests failed */
"test-result-testing-1-text"		= "Varning! Apple Hardware Test har upptäckt ett fel.";
"test-result-testing-2-text"		= " ";
"test-result-testing-3-text"		= "Först antecknar du felkoderna i testresultatområdet.";
"test-result-testing-4-text"		= " ";
"test-result-testing-5-text"		= "Om det finns externa tillbehör som är anslutna till datorn stänger du av datorn och kopplar från dem. Kör sedan det utökade testet och bekräfta resultaten.";
"test-result-testing-6-text"		= " ";
"test-result-testing-7-text"		= "Får du fortfarande ett felmeddelande, läser du i service- och supportmaterialet som följde med datorn om hur du kontaktar AppleCare för vidare assistans.";
"test-result-testing-8-text"		= " ";

/* About the Tests and Results Test POST failed */
"test-result-startup-1-text"		= "Varning! Apple Hardware Test har upptäckt ett fel under starten.";
"test-result-startup-2-text"		= " ";
"test-result-startup-3-text"		= "Först antecknar du felkoderna i testresultatområdet.";
"test-result-startup-4-text"		= " ";
"test-result-startup-5-text"		= "Om det finns externa tillbehör som är anslutna till datorn stänger du av datorn och kopplar från dem. Kör sedan det utökade testet och bekräfta resultaten.";
"test-result-startup-6-text"		= " ";
"test-result-startup-7-text"		= "Får du fortfarande ett felmeddelande, läser du i service- och supportmaterialet som följde med datorn om hur du kontaktar AppleCare för vidare assistans.";
"test-result-startup-8-text"		= " ";
"test-result-startup-9-text"		= " ";
"test-result-startup-10-text"		= " ";
"test-result-startup-11-text"		= " ";


/* HW-Profile values */

"prof-prod-group-title"			= "Produkt";
"prof-prod-group-subtitle"		= "Produktdetaljer:";
"prof-prod-name-label"			= "Mac-namn:";
"prof-prod-model-label"			= "Mac-modell:";
"prof-prod-cputype-label"		= "Centralprocessortyp:";
"prof-prod-cpucount-label"		= "Antal processorer:";
"prof-prod-cpucoretotal-label"	= "Totalt antal kärnor:";
"prof-prod-cpucorecount-label"	= "Antal kärnor:";
"prof-prod-cpuspeed-label"		= "Centralprocessorhastighet:";
"prof-prod-cpucache-label"		= "L2-centralprocessorcache (per processor):";

"prof-prod-L2cache-label"		= "L2-cache:";
"prof-prod-L2cachecore-label"	= "L2-cache (per kärna):";
"prof-prod-L3cache-label"		= "L3-cache:";

"prof-prod-cpucache3-label"		= "L3-centralprocessorcache (per centralprocessor):";
"prof-prod-mlb-sn-label"		= "MLB-serienr:";
"prof-processor-tray-sn-label"	= "Serienr på processorbricka:";

"prof-graph-group-title"		= "Bild";
"prof-graph-group-subtitle"		= "Grafikdetaljer:";
"prof-graph-chipset-label"		= "Grafik:";
"prof-graph-vram-label"			= "VRAM:";
"prof-graph-disp-width-label"	= "Skärmbredd (bildpunkter):";
"prof-graph-disp-height-label"	= "Skärmhöjd (bildpunkter):";

"prof-communi-group-title"		= "Kommunikation";
"prof-communi-group-subtitle"	= "Kommunikationsdetaljer:";
"prof-communi-enet-mac-label"	= "Ethernet-MAC-adress:";
"prof-communi-fwire-mac-label"	= "FireWire-MAC-adress:";
"prof-communi-airp-type-label"	= "AirPort:";
"prof-communi-bluetooth-label"	= "Bluetooth:";
"prof-communi-irport-label"		= "IR-mottagare:";
"prof-communi-usb1-connect-label"	= "USB-port 1:";
"prof-communi-usb2-connect-label"	= "USB-port 2:";
"prof-communi-usb3-connect-label"	= "USB-port 3:";
"prof-communi-usb4-connect-label"	= "USB-port 4:";

"prof-memo-group-title"			= "Minne";
"prof-memo-group-subtitle"		= "Minnesdetaljer:";
"prof-memo-overview-label"		= "Översikt";
"prof-memo-slot-1-label"		= "Minne 1";
"prof-memo-slot-2-label"		= "Minne 2";
"prof-memo-slot-3-label"		= "Minne 3";
"prof-memo-slot-4-label"		= "Minne 4";
"prof-memo-slot-5-label"		= "Minne 5";
"prof-memo-slot-6-label"		= "Minne 6";
"prof-memo-slot-7-label"		= "Minne 7";
"prof-memo-slot-8-label"		= "Minne 8";

"prof-memo-type-str"			= "MLB-fastlött SDRAM.";
"prof-memo--str"				= "Okänt";
"prof-memo-pc2-3700-str"		= "PC2-3700";
"prof-memo-pc2-4000-str"		= "PC2-4000";
"prof-memo-pc2-4200-str"		= "PC2-4200";
"prof-memo-pc2-4800-str"		= "PC2-4800";
"prof-memo-ddr2-str"			= "DDR2 SDRAM";
"prof-memo-fbdimm-str"			= "FBDIMM";
"prof-memo-cl-str"				= "CL";
"prof-memo-ct1-str"				= " Cykeltid (ns)";
"prof-memo-ct2-str"				= " Cykel (ns)";
"prof-memo-ct3-str"				= " (ns)";
"prof-memo-rev-str"				= "Rev.";
"prof-memo-paired-str"			= "I par med nr ";
"prof-memo-paired-not-str"		= " ej i par";
"prof-memo-mismatch-label"		= "Matchar ej:";
"prof-memo-size-str"			= " storlek";
"prof-memo-speed-str"			= " hastighet";
"prof-memo-vendor-str"			= " tillverkare";
"prof-memo-recommend-str"		= "Rekommenderas: ";
"prof-memo-post-fail-str"		= "POST-fel";

"prof-board-group-title"		= "Logikkort";
"prof-board-brom-vers-label"	= "Boot ROM-version:";
"prof-board-smc-vers-label"		= "SMC-version:";
"prof-board-syst-sn-label"		= "Datorns serienr:";
"prof-board-bootdev-label"		= "Förvald startenhet:";

"prof-stor-group-title"			= "Lagring";
"prof-stor-size-label"			= "Storlek:";

"prof-powr-group-title"			= "Ström";
"prof-powr-group-subtitle"		= "Strömdetaljer:";
"prof-powr-src-label"			= "Strömkälla:";
"prof-powr-src-wall-str"		= "Adapter";
"prof-powr-src-batt-str"		= "Batteri";
"prof-powr-ac-on-str"			= "Ansluten";
"prof-powr-ac-off-str"			= "Ej ansluten";
"prof-powr-capac-label"			= "Kapacitet:";
"prof-powr-volt-label"			= "Voltantal:";
"prof-powr-status-label"		= "Status:";

